"""
зауважте, що значення, що зберігається в кожному елементі - теж словник, і доступ до вкладеного списку
здійснюється за механізмом
student[outer_dict_key][inner_dict_key]

Є дані студентнів (комбіація імені та прізвища унікальна), що зберігаються за допомогою словника
1 - програмно добавити одного студента, з заповненням усіх полів (вік - від 18 до 40, цілочисельне значення,
    бал від 0 до 100 (інт чи флоат)
2 - створити і вивести на екран список студентів (імя та прізвище та середній бал), у яких середній бал більше 90
    сам формат наповнення цього списку up to you
3 - визначити середній бал по групі
4 - при відсутності номеру телефону у студента записати номер батьків (номер на ваш вибір)

не забувайте виводити інформаційні повідомлення щодо інформації, яку ви виводите
"""
students = {'Іван Петров': {
    'Пошта': 'Ivan@gmail.com',
    'Вік': 14,
    'Номер телефону': '+380987771221',
    'Середній бал': 95.8
}, 'Женя Курич': {
    'Пошта': 'Geka@gmail.com',
    'Вік': 16,
    'Номер телефону': None,
    'Середній бал': 64.5
}, 'Маша Кера': {
    'Пошта': 'Masha@gmail.com',
    'Вік': 18,
    'Номер телефону': '+380986671221',
    'Середній бал': 80
}, 'Олег Сидор': {
    'Пошта': 'Oleg@gmail.com',
    'Вік': 22,
    'Номер телефону': '+380973001112',
    'Середній бал': 92.3
}}
# ваш код нижче !!!!!!!! вище нічого не змінюємо

print("Новий студент успішно доданий!")

high_score_students = [(name, info['Середній бал']) for name, info in students.items() if info['Середній бал'] > 90]

print("Список студентів із середнім балом більше 90:")
for student in high_score_students:
    print(f"Ім'я та прізвище: {student[0]}, Середній бал: {student[1]}")

total_score = sum(info['Середній бал'] for info in students.values())
average_score = total_score / len(students)

print(f"Середній бал по групі: {average_score:.2f}")

for name, info in students.items():
    if not info['Номер телефону']:
        info['Номер телефону'] = '+380999111222'
        print(f"Для студента {name} додано номер телефону батьків: {info['Номер телефону']}")
